RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rcm.c
/*!
 * @file        apm32f4xx_rcm.c
 *
 * @brief       This file provides all the RCM firmware functions
 *
 * @version     V1.0.2
 *
 * @date        2022-06-23
 *
 * @attention
 *
 *  Copyright (C) 2021-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32f4xx_rcm.h"

/** @addtogroup APM32F4xx_StdPeriphDriver
  @{
*/

/** @defgroup RCM_Driver
  * @brief RCM driver modules
  @{
*/

/** @defgroup RCM_Functions
  @{
*/

/*!
 * @brief     Resets the clock configuration to the default state
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_Reset(void)
{
    /* Open HSI clock */
    RCM->CTRL_B.HSIEN = BIT_SET;
    /* Clear CFG register */
    RCM->CFG = (uint32_t)0x00000000;
    /* Reset HSEON, CSSON, PLLON, PLLI2S bits */
    RCM->CTRL &= (uint32_t)0xEAF6FFFF;

    /* Reset PLL1CFG register */
    RCM->PLL1CFG = 0x24003010;
    /* Reset PLL2CFG register */
    RCM->PLL2CFG = 0x20003000;

    /* Reset HSEBCFG bit */
    RCM->CTRL_B.HSEBCFG = BIT_RESET;

    /* Disable all interrupts and clear pending bits */
    RCM->INT = 0x00000000;
}

/*!
 * @brief     Configs the HSE oscillator
 *
 * @param     state: state of the HSE
 *                   This parameter can be one of the following values:
 *                   @arg RCM_HSE_CLOSE  : Turn off the HSE oscillator
 *                   @arg RCM_HSE_OPEN   : Turn on the HSE oscillator
 *                   @arg RCM_HSE_BYPASS : HSE oscillator bypassed with external clock
 *
 * @retval    None
 *
 * @note      When HSE is not used directly or through the PLL as system clock, it can be stopped.
 */
void RCM_ConfigHSE(RCM_HSE_T state)
{
    /* Reset HSEEN bit */
    RCM->CTRL_B.HSEEN = BIT_RESET;

    /* Reset HSEBCFG bit */
    RCM->CTRL_B.HSEBCFG = BIT_RESET;

    if (state == RCM_HSE_OPEN)
    {
        RCM->CTRL_B.HSEEN = BIT_SET;
    }
    else if (state == RCM_HSE_BYPASS)
    {
        RCM->CTRL_B.HSEBCFG = BIT_SET;
        RCM->CTRL_B.HSEEN = BIT_SET;
    }
}

/*!
 * @brief     Waits for HSE to be ready
 *
 * @param     None
 *
 * @retval    SUCCESS: HSE oscillator is ready
 *            ERROR  : HSE oscillator is not ready
 */

uint8_t RCM_WaitHSEReady(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < HSE_STARTUP_TIMEOUT; cnt++)
    {
        if (RCM->CTRL_B.HSERDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }

    return ERROR;
}

/*!
 * @brief     Config HSI trimming value
 *
 * @param     HSITrim: HSI trimming value
 *                     This parameter must be a number between 0 and 0x1F.
 *
 * @retval    None
 */
void RCM_ConfigHSITrim(uint8_t HSITrim)
{
    RCM->CTRL_B.HSITRIM = HSITrim;
}

/*!
 * @brief     Enable the HSI
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableHSI(void)
{
    RCM->CTRL_B.HSIEN = BIT_SET;
}

/*!
 * @brief     Disable the HSI
 *
 * @param     None
 *
 * @retval    None
 *
 * @note      When HSI is not used directly or through the PLL as system clock, it can be stopped.
 */

void RCM_DisableHSI(void)
{
    RCM->CTRL_B.HSIEN = BIT_RESET;
}

/*!
 * @brief     Configures the External Low Speed oscillator (LSE)
 *
 * @param     state : Specifies the new state of the LSE
 *                    This parameter can be one of the following values:
 *                    @arg RCM_LSE_CLOSE  : Close the LSE
 *                    @arg RCM_LSE_OPEN   : Open the LSE
 *                    @arg RCM_LSE_BYPASS : LSE bypass
 *
 * @retval    None
 */
void RCM_ConfigLSE(RCM_LSE_T state)
{
    RCM->BDCTRL_B.LSEEN = BIT_RESET;
    RCM->BDCTRL_B.LSEBCFG = BIT_RESET;

    if (state == RCM_LSE_OPEN)
    {
        RCM->BDCTRL_B.LSEEN = BIT_SET;
    }
    else if (state == RCM_LSE_BYPASS)
    {
        RCM->BDCTRL_B.LSEBCFG = BIT_SET;
        RCM->BDCTRL_B.LSEEN = BIT_SET;
    }
}

/*!
 * @brief     Enables the Internal Low Speed oscillator (LSI)
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableLSI(void)
{
    RCM->CSTS_B.LSIEN = BIT_SET;
}

/*!
 * @brief     Disables the Internal Low Speed oscillator (LSI)
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableLSI(void)
{
    RCM->CSTS_B.LSIEN = BIT_RESET;
}

/*!
 * @brief     Configures the main PLL clock source, multiplication and division factors
 *
 * @param     pllSelect: PLL entry clock source select
 *                       This parameter can be one of the following values:
 *                       @arg RCM_PLLSEL_HSI: HSI oscillator clock selected as PLL clock entry
 *                       @arg RCM_PLLSEL_HSE: HSE oscillator clock selected as PLL clock entry
 *
 * @param     inputDiv: specifies the Division factor for PLL VCO input clock
 *                      This parameter must be a number between 0 and 63
 *
 * @param     vcoMul: specifies the Multiplication factor for PLL VCO output clock
 *                    This parameter must be a number between 50 and 432
 *
 * @param     sysDiv: specifies the Division factor for main system clock (SYSCLK)
 *                    This parameter can be one of the following values:
 *                    @arg RCM_PLL_SYS_DIV_2 : system clock Division factor is 2
 *                    @arg RCM_PLL_SYS_DIV_4 : system clock Division factor is 4
 *                    @arg RCM_PLL_SYS_DIV_6 : system clock Division factor is 6
 *                    @arg RCM_PLL_SYS_DIV_8 : system clock Division factor is 8
 *
 * @param     appDiv: specifies the Division factor for OTG FS, SDIO and RNG clocks
 *                    This parameter must be a number between 4 and 15
 *
 * @retval    None
 */
void RCM_ConfigPLL1(uint32_t pllSelect, uint32_t inputDiv, uint32_t vcoMul,
                   RCM_PLL_SYS_DIV_T sysDiv, uint32_t appDiv)
{
    RCM->PLL1CFG_B.PLL1CLKS = pllSelect;
    RCM->PLL1CFG_B.PLLB = inputDiv;
    RCM->PLL1CFG_B.PLL1A = vcoMul;
    RCM->PLL1CFG_B.PLL1C = sysDiv;
    RCM->PLL1CFG_B.PLLD = appDiv;
}

/*!
 * @brief      Enables the PLL1
 *
 * @param      None
 *
 * @retval     None
 */
void RCM_EnablePLL1(void)
{
    RCM->CTRL_B.PLL1EN = BIT_SET;
}

/*!
 * @brief      Disable the PLL
 *
 * @param      None
 *
 * @retval     None
 *
 * @note       When PLL1 is not used as system clock, it can be stopped.
 */
void RCM_DisablePLL1(void)
{
    RCM->CTRL_B.PLL1EN = BIT_RESET;
}

/*!
 * @brief     Configures the RCM_PLL2CFG register
 *
 * @param     i2sVcoMul: specifies the multiplication factor for PLLI2S VCO output clock
 *                       This parameter must be a number between 50 and 432
 *
 * @param     i2sDiv: specifies the division factor for I2S clock
 *                    This parameter must be a number between 2 and 7
 *
 * @retval    None
 */
void RCM_ConfigPLL2(uint32_t i2sVcoMul, uint32_t i2sDiv)
{
    RCM->PLL2CFG_B.PLL2A = i2sVcoMul;
    RCM->PLL2CFG_B.PLL2C = i2sDiv;
}

/*!
 * @brief      Enables the PLL2
 *
 * @param      None
 *
 * @retval     None
 */
void RCM_EnablePLL2(void)
{
    RCM->CTRL_B.PLL2EN = BIT_SET;
}

/*!
 * @brief      Disable the PLL2
 *
 * @param      None
 *
 * @retval     None
 */
void RCM_DisablePLL2(void)
{
    RCM->CTRL_B.PLL2EN = BIT_RESET;
}

/*!
 * @brief     Enable the Clock Security System
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableCSS(void)
{
    RCM->CTRL_B.CSSEN = BIT_SET;
}

/*!
 * @brief     Disable the Clock Security System
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableCSS(void)
{
    RCM->CTRL_B.CSSEN = BIT_RESET;
}

/*!
 * @brief     Selects the clock source to output on MCO1 pin
 *
 * @param     mco1Div: specifies the clock source to output
 *                     This parameter can be one of the following values:
 *                     @arg RCM_MCO1_SEL_HSICLK : HSI clock selected as MCO1 source
 *                     @arg RCM_MCO1_SEL_LSECLK : LSE clock selected as MCO1 source
 *                     @arg RCM_MCO1_SEL_HSECLK : HSE clock selected as MCO1 source
 *                     @arg RCM_MCO1_SEL_PLLCLK : main PLL clock selected as MCO1 source
 *
 * @param     mco1Div: specifies the MCO1 prescaler
 *                     This parameter can be one of the following values:
 *                     @arg RCM_MCO1_DIV_1 : no division applied to MCO1 clock
 *                     @arg RCM_MCO1_DIV_2 : division by 2 applied to MCO1 clock
 *                     @arg RCM_MCO1_DIV_3 : division by 3 applied to MCO1 clock
 *                     @arg RCM_MCO1_DIV_4 : division by 4 applied to MCO1 clock
 *                     @arg RCM_MCO1_DIV_5 : division by 5 applied to MCO1 clock
 *
 * @retval    None
 */
void RCM_ConfigMCO1(RCM_MCO1_SEL_T mco1Select, RCM_MCO1_DIV_T mco1Div)
{
    RCM->CFG_B.MCO1SEL = mco1Select;
    RCM->CFG_B.MCO1PRE = mco1Div;
}

/*!
 * @brief     Selects the clock source to output on MCO2 pin
 *
 * @param     mco2Select: specifies the clock source to output
 *                        This parameter can be one of the following values:
 *                        @arg RCM_MCO2_SEL_SYSCLK  : SYS clock selected as MCO2 source
 *                        @arg RCM_MCO2_SEL_PLL2CLK : PLL2 clock selected as MCO2 source
 *                        @arg RCM_MCO2_SEL_HSECLK  : HSE clock selected as MCO2 source
 *                        @arg RCM_MCO2_SEL_PLLCLK  : PLL clock selected as MCO2 source
 *
 * @param     mco2Div: specifies the MCO2 prescaler
 *                     This parameter can be one of the following values:
 *                     @arg RCM_MCO2_DIV_1 : no division applied to MCO2 clock
 *                     @arg RCM_MCO2_DIV_2 : division by 2 applied to MCO2 clock
 *                     @arg RCM_MCO2_DIV_3 : division by 3 applied to MCO2 clock
 *                     @arg RCM_MCO2_DIV_4 : division by 4 applied to MCO2 clock
 *                     @arg RCM_MCO2_DIV_5 : division by 5 applied to MCO2 clock
 *
 * @retval    None
 */
void RCM_ConfigMCO2(RCM_MCO2_SEL_T mco2Select, RCM_MCO2_DIV_T mco2Div)
{
    RCM->CFG_B.MCO2SEL = mco2Select;
    RCM->CFG_B.MCO2PRE = mco2Div;
}

/*!
 * @brief    Configures the system clock source
 *
 * @param    sysClkSelect: specifies the clock source used as system clock
 *                         This parameter can be one of the following values:
 *                         @arg RCM_SYSCLK_SEL_HSI : HSI is selected as system clock source
 *                         @arg RCM_SYSCLK_SEL_HSE : HSE is selected as system clock source
 *                         @arg RCM_SYSCLK_SEL_PLL : PLL is selected as system clock source
 *
 * @retva    None
 */
void RCM_ConfigSYSCLK(RCM_SYSCLK_SEL_T sysClkSelect)
{
    RCM->CFG_B.SCLKSEL = sysClkSelect;
}

/*!
 * @brief     Returns the clock source which is used as system clock
 *
 * @param     None
 *
 * @retval    The clock source used as system clock
 */
RCM_SYSCLK_SEL_T RCM_ReadSYSCLKSource(void)
{
    return (RCM_SYSCLK_SEL_T)RCM->CFG_B.SCLKSWSTS;
}

/*!
 * @brief     Configs the AHB clock prescaler.
 *
 * @param     AHBDiv : Specifies the AHB clock prescaler from the system clock.
 *                     This parameter can be one of the following values:
 *                     @arg RCM_AHB_DIV_1   : HCLK = SYSCLK
 *                     @arg RCM_AHB_DIV_2   : HCLK = SYSCLK / 2
 *                     @arg RCM_AHB_DIV_4   : HCLK = SYSCLK / 4
 *                     @arg RCM_AHB_DIV_8   : HCLK = SYSCLK / 8
 *                     @arg RCM_AHB_DIV_16  : HCLK = SYSCLK / 16
 *                     @arg RCM_AHB_DIV_64  : HCLK = SYSCLK / 64
 *                     @arg RCM_AHB_DIV_128 : HCLK = SYSCLK / 128
 *                     @arg RCM_AHB_DIV_256 : HCLK = SYSCLK / 256
 *                     @arg RCM_AHB_DIV_512 : HCLK = SYSCLK / 512
 *
 * @retval    None
 */
void RCM_ConfigAHB(RCM_AHB_DIV_T AHBDiv)
{
    RCM->CFG_B.AHBPSC = AHBDiv;
}

/*!
 * @brief     Configs the APB1 clock prescaler.
 *
 * @param     APB1Div: Specifies the APB1 clock prescaler from the AHB clock.
 *                     This parameter can be one of the following values:
 *                     @arg RCM_APB_DIV_1  : PCLK1 = HCLK
 *                     @arg RCM_APB_DIV_2  : PCLK1 = HCLK / 2
 *                     @arg RCM_APB_DIV_4  : PCLK1 = HCLK / 4
 *                     @arg RCM_APB_DIV_8  : PCLK1 = HCLK / 8
 *                     @arg RCM_APB_DIV_16 : PCLK1 = HCLK / 16
 *
 * @retval    None
 */
void RCM_ConfigAPB1(RCM_APB_DIV_T APB1Div)
{
    RCM->CFG_B.APB1PSC = APB1Div;
}

/*!
 * @brief     Configs the APB2 clock prescaler
 *
 * @param     APB2Div: Specifies the APB2 clock prescaler from the AHB clock.
 *                     This parameter can be one of the following values:
 *                     @arg RCM_APB_DIV_1  : PCLK2 = HCLK
 *                     @arg RCM_APB_DIV_2  : PCLK2 = HCLK / 2
 *                     @arg RCM_APB_DIV_4  : PCLK2 = HCLK / 4
 *                     @arg RCM_APB_DIV_8  : PCLK2 = HCLK / 8
 *                     @arg RCM_APB_DIV_16 : PCLK2 = HCLK / 16
 *
 * @retval    None
 */
void RCM_ConfigAPB2(RCM_APB_DIV_T APB2Div)
{
    RCM->CFG_B.APB2PSC = APB2Div;
}

/*!
 * @brief     Configs the SDRAM clock prescaler
 *
 * @param     SDRAMDiv: Specifies the SDRAM clock prescaler from the DMC clock.
 *                     This parameter can be one of the following values:
 *                     @arg RCM_SDRAM_DIV_1 : SDRAM clock = DMC clock
 *                     @arg RCM_SDRAM_DIV_2 : SDRAM clock = DMC clock / 2
 *                     @arg RCM_SDRAM_DIV_4 : SDRAM clock = DMC clock / 4
 *
 * @retval    None
 */
void RCM_ConfigSDRAM(RCM_SDRAM_DIV_T SDRAMDiv)
{
    RCM->CFG_B.SDRAMPSC = SDRAMDiv;
}

/*!
 * @brief     Reads the frequency of SYSCLK
 *
 * @param     None
 *
 * @retval    Return the frequency of SYSCLK
 */
uint32_t RCM_ReadSYSCLKFreq(void)
{
    uint32_t sysClock, pllMull, pllSource, pllvco;

    /* get sys clock */
    sysClock = RCM->CFG_B.SCLKSWSTS;

    switch (sysClock)
    {
        /* sys clock is HSI */
        case RCM_SYSCLK_SEL_HSI:
            sysClock = HSI_VALUE;
            break;

        /* sys clock is HSE */
        case RCM_SYSCLK_SEL_HSE:
            sysClock = HSE_VALUE;
            break;

        /* sys clock is PLL */
        case RCM_SYSCLK_SEL_PLL:
            pllMull = RCM->PLL1CFG_B.PLLB;
            pllSource = RCM->PLL1CFG_B.PLL1CLKS;

            /* PLL entry clock source is HSE */
            if (pllSource == BIT_SET)
            {
                /* HSE used as PLL clock source */
                pllvco = (HSE_VALUE / pllMull) * (RCM->PLL1CFG_B.PLL1A);
            }
            else
            {
                /* HSI used as PLL clock source */
                pllvco = (HSI_VALUE / pllMull) * (RCM->PLL1CFG_B.PLL1A);
            }

            sysClock = pllvco/((RCM->PLL1CFG_B.PLL1C + 1) *2);
            break;

        default:
            sysClock  = HSI_VALUE;
            break;
    }

