RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rcm.c
    return sysClock;
}

/*!
 * @brief     Reads the frequency of HCLK(AHB)
 *
 * @param     None
 *
 * @retval    Return the frequency of HCLK
 */
uint32_t RCM_ReadHCLKFreq(void)
{
    uint32_t divider;
    uint32_t sysClk, hclk;
    uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

    sysClk = RCM_ReadSYSCLKFreq();
    divider = AHBPrescTable[RCM->CFG_B.AHBPSC];
    hclk = sysClk >> divider;

    return hclk;
}

/*!
 * @brief     Reads the frequency of PCLK1 And PCLK2
 *
 * @param     PCLK1 : Return the frequency of PCLK1
 *
 * @param     PCLK1 : Return the frequency of PCLK2
 *
 * @retval    None
 */
void RCM_ReadPCLKFreq(uint32_t* PCLK1, uint32_t* PCLK2)
{
    uint32_t hclk, divider;
    uint8_t APBPrescTable[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    hclk = RCM_ReadHCLKFreq();

    if (PCLK1)
    {
        divider = APBPrescTable[RCM->CFG_B.APB1PSC];
        *PCLK1 = hclk >> divider;
    }

    if (PCLK2)
    {
        divider = APBPrescTable[RCM->CFG_B.APB2PSC];
        *PCLK2 = hclk >> divider;
    }
}

/*!
 * @brief     Configures the RTC clock source
 *
 * @param     rtcClkSelect : specifies the RTC clock source.
 *                           This parameter can be one of the following values:
 *                           @arg RCM_RTCCLK_LSE        : RTCCLK = LSE clock
 *                           @arg RCM_RTCCLK_LSI        : RTCCLK = LSI clock
 *                           @arg RCM_RTCCLK_HSE_DIVX   : X:[2:31]
 *
 * @retval    None
 */
void RCM_ConfigRTCCLK(RCM_RTCCLK_T rtcClkSelect)
{
    if (rtcClkSelect <= 1)
    {
        RCM->BDCTRL_B.RTCSRCSEL = (rtcClkSelect + 1);
    }

    else
    {
        RCM->BDCTRL_B.RTCSRCSEL = 3;
        RCM->CFG_B.RTCPSC = rtcClkSelect;
    }
}

/*!
 * @brief     Enables the RTC clock
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableRTCCLK(void)
{
    RCM->BDCTRL_B.RTCCLKEN = BIT_SET;
}

/*!
 * @brief     Disables the RTC clock
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableRTCCLK(void)
{
    RCM->BDCTRL_B.RTCCLKEN = BIT_RESET;
}
/*!
 * @brief     Enable the Backup domain reset
 *
 * @param     None
 *
 * @retval    None
 *
 * @note
 */
void RCM_EnableBackupReset(void)
{
    RCM->BDCTRL_B.BDRST = BIT_SET;
}

/*!
 * @brief     Disable the Backup domain reset
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableBackupReset(void)
{
    RCM->BDCTRL_B.BDRST = BIT_RESET;
}

/*!
 * @brief     Configures the I2S clock source (I2SCLK)
 *
 * @param     i2sClkSource: specifies the I2S clock source
 *                          This parameter can be one of the following values:
 *                          @arg RCM_I2S_CLK_PLLI2S : PLLI2S is selected as I2S clock source
 *                          @arg RCM_I2S_CLK_EXT    : EXT is selected as I2S clock source
 *
 * @retval    None
 */
void RCM_ConfigI2SCLK(RCM_I2S_CLK_T i2sClkSource)
{
    RCM->CFG_B.I2SSEL = i2sClkSource;
}

/*!
 * @brief    Enables AHB1 peripheral clock
 *
 * @param    AHB1Periph : Enable the specifies clock of AHB peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB1_PERIPH_GPIOA       : Enable GPIOA clock
 *                       @arg RCM_AHB1_PERIPH_GPIOB       : Enable GPIOB clock
 *                       @arg RCM_AHB1_PERIPH_GPIOC       : Enable GPIOC clock
 *                       @arg RCM_AHB1_PERIPH_GPIOD       : Enable GPIOD clock
 *                       @arg RCM_AHB1_PERIPH_GPIOE       : Enable GPIOE clock
 *                       @arg RCM_AHB1_PERIPH_GPIOF       : Enable GPIOF clock
 *                       @arg RCM_AHB1_PERIPH_GPIOG       : Enable GPIOG clock
 *                       @arg RCM_AHB1_PERIPH_GPIOI       : Enable GPIOI clock
 *                       @arg RCM_AHB1_PERIPH_CRC         : Enable CRC clock
 *                       @arg RCM_AHB1_PERIPH_BKPSRAM     : Enable BKPSRAM interface clock
 *                       @arg RCM_AHB1_PERIPH_CCMDATARAMEN: Enable CCM data RAM interface clock
 *                       @arg RCM_AHB1_PERIPH_DMA1        : Enable DMA1 clock
 *                       @arg RCM_AHB1_PERIPH_DMA2        : Enable DMA2 clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC     : Enable Ethernet MAC clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Tx  : Enable Ethernet Transmission clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Rx  : Enable Ethernet Reception clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_PTP : Enable Ethernet PTP clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS      : Enable USB OTG HS clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS_ULPI : Enable USB OTG HS ULPI clock
 *
 * @retval    None
 */
void RCM_EnableAHB1PeriphClock(uint32_t AHB1Periph)
{
    RCM->AHB1CLKEN |= AHB1Periph;
}

/*!
 * @brief    Disable AHB1 peripheral clock
 *
 * @param    AHB1Periph : Disable the specifies clock of AHB1 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB1_PERIPH_GPIOA       : Disable GPIOA clock
 *                       @arg RCM_AHB1_PERIPH_GPIOB       : Disable GPIOB clock
 *                       @arg RCM_AHB1_PERIPH_GPIOC       : Disable GPIOC clock
 *                       @arg RCM_AHB1_PERIPH_GPIOD       : Disable GPIOD clock
 *                       @arg RCM_AHB1_PERIPH_GPIOE       : Disable GPIOE clock
 *                       @arg RCM_AHB1_PERIPH_GPIOF       : Disable GPIOF clock
 *                       @arg RCM_AHB1_PERIPH_GPIOG       : Disable GPIOG clock
 *                       @arg RCM_AHB1_PERIPH_GPIOI       : Disable GPIOI clock
 *                       @arg RCM_AHB1_PERIPH_CRC         : Disable CRC clock
 *                       @arg RCM_AHB1_PERIPH_BKPSRAM     : Disable BKPSRAM interface clock
 *                       @arg RCM_AHB1_PERIPH_CCMDATARAMEN: Disable CCM data RAM interface clock
 *                       @arg RCM_AHB1_PERIPH_DMA1        : Disable DMA1 clock
 *                       @arg RCM_AHB1_PERIPH_DMA2        : Disable DMA2 clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC     : Disable Ethernet MAC clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Tx  : Disable Ethernet Transmission clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Rx  : Disable Ethernet Reception clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_PTP : Disable Ethernet PTP clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS      : Disable USB OTG HS clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS_ULPI : Disable USB OTG HS ULPI clock
 *
 * @retval    None
 */
void RCM_DisableAHB1PeriphClock(uint32_t AHB1Periph)
{
    RCM->AHB1CLKEN &= (uint32_t)~AHB1Periph;
}

/*!
 * @brief    Enables AHB2 peripheral clock
 *
 * @param    AHB2Periph : Enable the specifies clock of AHB2 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB2_PERIPH_DCI       : Enable DCI clock
 *                       @arg RCM_AHB2_PERIPH_FPU       : Enable FPU clock
 *                       @arg RCM_AHB2_PERIPH_BN        : Enable BN clock
 *                       @arg RCM_AHB2_PERIPH_SM        : Enable SM clock
 *                       @arg RCM_AHB2_PERIPH_CRYP      : Enable CRYP clock
 *                       @arg RCM_AHB2_PERIPH_HASH      : Enable HASH clock
 *                       @arg RCM_AHB2_PERIPH_RNG       : Enable RNG clock
 *                       @arg RCM_AHB2_PERIPH_OTG_FS    : Enable OTG FS clock
 *
 * @retval    None
 */
void RCM_EnableAHB2PeriphClock(uint32_t AHB2Periph)
{
    RCM->AHB2CLKEN |= AHB2Periph;
}

/*!
 * @brief    Disable AHB2 peripheral clock
 *
 * @param    AHB2Periph : Disable the specifies clock of AHB2 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB2_PERIPH_DCI       : Disable DCI clock
 *                       @arg RCM_AHB2_PERIPH_FPU       : Disable FPU clock
 *                       @arg RCM_AHB2_PERIPH_BN        : Disable BN clock
 *                       @arg RCM_AHB2_PERIPH_SM        : Disable SM clock
 *                       @arg RCM_AHB2_PERIPH_CRYP      : Disable CRYP clock
 *                       @arg RCM_AHB2_PERIPH_HASH      : Disable HASH clock
 *                       @arg RCM_AHB2_PERIPH_RNG       : Disable RNG clock
 *                       @arg RCM_AHB2_PERIPH_OTG_FS    : Disable OTG FS clock
 *
 * @retval    None
 */
void RCM_DisableAHB2PeriphClock(uint32_t AHB2Periph)
{
    RCM->AHB2CLKEN &= (uint32_t)~AHB2Periph;
}

/*!
 * @brief    Enable the Low Speed APB (APB1) peripheral clock
 *
 * @param    APB1Periph : Enable specifies clock of the APB1 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB1_PERIPH_TMR2   : Enable TMR2 clock
 *                        @arg RCM_APB1_PERIPH_TMR3   : Enable TMR3 clock
 *                        @arg RCM_APB1_PERIPH_TMR4   : Enable TMR4 clock
 *                        @arg RCM_APB1_PERIPH_TMR5   : Enable TMR5 clock
 *                        @arg RCM_APB1_PERIPH_TMR6   : Enable TMR6 clock
 *                        @arg RCM_APB1_PERIPH_TMR7   : Enable TMR7 clock
 *                        @arg RCM_APB1_PERIPH_TMR12  : Enable TMR12 clock
 *                        @arg RCM_APB1_PERIPH_TMR13  : Enable TMR13 clock
 *                        @arg RCM_APB1_PERIPH_TMR14  : Enable TMR14 clock
 *                        @arg RCM_APB1_PERIPH_WWDT   : Enable WWDT clock
 *                        @arg RCM_APB1_PERIPH_SPI2   : Enable SPI2 clock
 *                        @arg RCM_APB1_PERIPH_SPI3   : Enable SPI3 clock
 *                        @arg RCM_APB1_PERIPH_USART2 : Enable USART2 clock
 *                        @arg RCM_APB1_PERIPH_USART3 : Enable USART3 clock
 *                        @arg RCM_APB1_PERIPH_UART4  : Enable UART4 clock
 *                        @arg RCM_APB1_PERIPH_UART5  : Enable UART5 clock
 *                        @arg RCM_APB1_PERIPH_I2C1   : Enable I2C1 clock
 *                        @arg RCM_APB1_PERIPH_I2C2   : Enable I2C2 clock
 *                        @arg RCM_APB1_PERIPH_I2C3   : Enable I2C3 clock
 *                        @arg RCM_APB1_PERIPH_FMPI2C1: Enable FMPI2C1 clock
 *                        @arg RCM_APB1_PERIPH_CAN1   : Enable CAN1 clock
 *                        @arg RCM_APB1_PERIPH_CAN2   : Enable CAN2 clock
 *                        @arg RCM_APB1_PERIPH_PMU    : Enable PMU clock
 *                        @arg RCM_APB1_PERIPH_DAC    : Enable DAC clock
 *                        @arg RCM_APB1_PERIPH_UART7  : Enable UART7 clock
 *                        @arg RCM_APB1_PERIPH_UART8  : Enable UART8 clock
 *
 * @retval   None
 */
void RCM_EnableAPB1PeriphClock(uint32_t APB1Periph)
{
    RCM->APB1CLKEN |= APB1Periph;
}

/*!
 * @brief    Disable the Low Speed APB (APB1) peripheral clock
 *
 * @param    APB1Periph : Disable specifies clock of the APB1 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB1_PERIPH_TMR2   : Disable TMR2 clock
 *                        @arg RCM_APB1_PERIPH_TMR3   : Disable TMR3 clock
 *                        @arg RCM_APB1_PERIPH_TMR4   : Disable TMR4 clock
 *                        @arg RCM_APB1_PERIPH_TMR5   : Disable TMR5 clock
 *                        @arg RCM_APB1_PERIPH_TMR6   : Disable TMR6 clock
 *                        @arg RCM_APB1_PERIPH_TMR7   : Disable TMR7 clock
 *                        @arg RCM_APB1_PERIPH_TMR12  : Disable TMR12 clock
 *                        @arg RCM_APB1_PERIPH_TMR13  : Disable TMR13 clock
 *                        @arg RCM_APB1_PERIPH_TMR14  : Disable TMR14 clock
 *                        @arg RCM_APB1_PERIPH_WWDT   : Disable WWDT clock
 *                        @arg RCM_APB1_PERIPH_SPI2   : Disable SPI2 clock
 *                        @arg RCM_APB1_PERIPH_SPI3   : Disable SPI3 clock
 *                        @arg RCM_APB1_PERIPH_USART2 : Disable USART2 clock
 *                        @arg RCM_APB1_PERIPH_USART3 : Disable USART3 clock
 *                        @arg RCM_APB1_PERIPH_UART4  : Disable UART4 clock
 *                        @arg RCM_APB1_PERIPH_UART5  : Disable UART5 clock
 *                        @arg RCM_APB1_PERIPH_I2C1   : Disable I2C1 clock
 *                        @arg RCM_APB1_PERIPH_I2C2   : Disable I2C2 clock
 *                        @arg RCM_APB1_PERIPH_I2C3   : Disable I2C3 clock
 *                        @arg RCM_APB1_PERIPH_FMPI2C1: Disable FMPI2C1 clock
 *                        @arg RCM_APB1_PERIPH_CAN1   : Disable CAN1 clock
 *                        @arg RCM_APB1_PERIPH_CAN2   : Disable CAN2 clock
 *                        @arg RCM_APB1_PERIPH_PMU    : Disable PMU clock
 *                        @arg RCM_APB1_PERIPH_DAC    : Disable DAC clock
 *                        @arg RCM_APB1_PERIPH_UART7  : Disable UART7 clock
 *                        @arg RCM_APB1_PERIPH_UART8  : Disable UART8 clock
 *
 * @retval   None
 */
void RCM_DisableAPB1PeriphClock(uint32_t APB1Periph)
{
    RCM->APB1CLKEN &= (uint32_t)~APB1Periph;
}

/*!
 * @brief    Enable the High Speed APB (APB2) peripheral clock
 *
 * @param    APB2Periph : Enable specifies clock of the APB2 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB2_PERIPH_TMR1   : TMR1 clock
 *                        @arg RCM_APB2_PERIPH_TMR8   : TMR8 clock
 *                        @arg RCM_APB2_PERIPH_USART1 : USART1 clock
 *                        @arg RCM_APB2_PERIPH_USART6 : USART6 clock
 *                        @arg RCM_APB2_PERIPH_ADC1   : ADC1 clock
 *                        @arg RCM_APB2_PERIPH_ADC2   : ADC2 clock
 *                        @arg RCM_APB2_PERIPH_ADC3   : ADC3 clock
 *                        @arg RCM_APB2_PERIPH_SDIO   : SDIO clock
 *                        @arg RCM_APB2_PERIPH_SPI1   : SPI1 clock
 *                        @arg RCM_APB2_PERIPH_SPI4   : SPI4 clock
 *                        @arg RCM_APB2_PERIPH_SYSCFG : SYSCFG clock
 *                        @arg RCM_APB2_PERIPH_TMR9   : TMR9 clock
 *                        @arg RCM_APB2_PERIPH_TMR10  : TMR10 clock
 *                        @arg RCM_APB2_PERIPH_TMR11  : TMR11 clock
 *                        @arg RCM_APB2_PERIPH_SPI5   : SPI5 clock
 *                        @arg RCM_APB2_PERIPH_SPI6   : SPI6 clock
 *
 * @retval   None
 */
void RCM_EnableAPB2PeriphClock(uint32_t APB2Periph)
{
    RCM->APB2CLKEN |= APB2Periph;
}

/*!
 * @brief    Disable the High Speed APB (APB2) peripheral clock
 *
 * @param    APB2Periph : Disable specifies clock of the APB2 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB2_PERIPH_TMR1   : TMR1 clock
 *                        @arg RCM_APB2_PERIPH_TMR8   : TMR8 clock
 *                        @arg RCM_APB2_PERIPH_USART1 : USART1 clock
 *                        @arg RCM_APB2_PERIPH_USART6 : USART6 clock
 *                        @arg RCM_APB2_PERIPH_ADC1   : ADC1 clock
 *                        @arg RCM_APB2_PERIPH_ADC2   : ADC2 clock
 *                        @arg RCM_APB2_PERIPH_ADC3   : ADC3 clock
 *                        @arg RCM_APB2_PERIPH_SDIO   : SDIO clock
 *                        @arg RCM_APB2_PERIPH_SPI1   : SPI1 clock
 *                        @arg RCM_APB2_PERIPH_SPI4   : SPI4 clock
 *                        @arg RCM_APB2_PERIPH_SYSCFG : SYSCFG clock
 *                        @arg RCM_APB2_PERIPH_TMR9   : TMR9 clock
 *                        @arg RCM_APB2_PERIPH_TMR10  : TMR10 clock
 *                        @arg RCM_APB2_PERIPH_TMR11  : TMR11 clock
 *                        @arg RCM_APB2_PERIPH_SPI5   : SPI5 clock
 *                        @arg RCM_APB2_PERIPH_SPI6   : SPI6 clock
 *
 * @retval   None
 */
void RCM_DisableAPB2PeriphClock(uint32_t APB2Periph)
{
    RCM->APB2CLKEN &= (uint32_t)~APB2Periph;
}

/*!
 * @brief    Enables AHB1 peripheral reset
 *
 * @param    AHB1Periph : Enable the specifies reset of AHB peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB1_PERIPH_GPIOA       : Enable GPIOA reset
 *                       @arg RCM_AHB1_PERIPH_GPIOB       : Enable GPIOB reset
 *                       @arg RCM_AHB1_PERIPH_GPIOC       : Enable GPIOC reset
 *                       @arg RCM_AHB1_PERIPH_GPIOD       : Enable GPIOD reset
 *                       @arg RCM_AHB1_PERIPH_GPIOE       : Enable GPIOE reset
 *                       @arg RCM_AHB1_PERIPH_GPIOF       : Enable GPIOF reset
 *                       @arg RCM_AHB1_PERIPH_GPIOG       : Enable GPIOG reset
 *                       @arg RCM_AHB1_PERIPH_GPIOI       : Enable GPIOI reset
 *                       @arg RCM_AHB1_PERIPH_CRC         : Enable CRC reset
 *                       @arg RCM_AHB1_PERIPH_BKPSRAM     : Enable BKPSRAM interface reset
 *                       @arg RCM_AHB1_PERIPH_CCMDATARAMEN: Enable CCM data RAM interface reset
 *                       @arg RCM_AHB1_PERIPH_DMA1        : Enable DMA1 reset
 *                       @arg RCM_AHB1_PERIPH_DMA2        : Enable DMA2 reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC     : Enable Ethernet MAC reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Tx  : Enable Ethernet Transmission reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Rx  : Enable Ethernet Reception reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_PTP : Enable Ethernet PTP reset
 *                       @arg RCM_AHB1_PERIPH_OTG_HS      : Enable USB OTG HS reset
 *                       @arg RCM_AHB1_PERIPH_OTG_HS_ULPI : Enable USB OTG HS ULPI clock
 *
 * @retval    None
 */
void RCM_EnableAHB1PeriphReset(uint32_t AHB1Periph)
{
    RCM->AHB1RST |= AHB1Periph;
}

/*!
 * @brief    Disable AHB1 peripheral reset
 *
 * @param    AHB1Periph : Disable the specifies reset of AHB1 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB1_PERIPH_GPIOA       : Disable GPIOA reset
 *                       @arg RCM_AHB1_PERIPH_GPIOB       : Disable GPIOB reset
 *                       @arg RCM_AHB1_PERIPH_GPIOC       : Disable GPIOC reset
 *                       @arg RCM_AHB1_PERIPH_GPIOD       : Disable GPIOD reset
 *                       @arg RCM_AHB1_PERIPH_GPIOE       : Disable GPIOE reset
 *                       @arg RCM_AHB1_PERIPH_GPIOF       : Disable GPIOF reset
 *                       @arg RCM_AHB1_PERIPH_GPIOG       : Disable GPIOG reset
 *                       @arg RCM_AHB1_PERIPH_GPIOI       : Disable GPIOI reset
 *                       @arg RCM_AHB1_PERIPH_CRC         : Disable CRC reset
 *                       @arg RCM_AHB1_PERIPH_BKPSRAM     : Disable BKPSRAM interface reset
 *                       @arg RCM_AHB1_PERIPH_CCMDATARAMEN: Disable CCM data RAM interface reset
 *                       @arg RCM_AHB1_PERIPH_DMA1        : Disable DMA1 reset
 *                       @arg RCM_AHB1_PERIPH_DMA2        : Disable DMA2 reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC     : Disable Ethernet MAC reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Tx  : Disable Ethernet Transmission reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Rx  : Disable Ethernet Reception reset
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_PTP : Disable Ethernet PTP reset
 *                       @arg RCM_AHB1_PERIPH_OTG_HS      : Disable USB OTG HS reset
 *                       @arg RCM_AHB1_PERIPH_OTG_HS_ULPI : Disable USB OTG HS ULPI reset
 *
 * @retval    None
 */
void RCM_DisableAHB1PeriphReset(uint32_t AHB1Periph)
{
    RCM->AHB1RST &= (uint32_t)~AHB1Periph;
}

/*!
 * @brief    Enables AHB2 peripheral reset
 *
 * @param    AHB2Periph : Enable the specifies reset of AHB2 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB2_PERIPH_DCI       : Enable DCI reset
 *                       @arg RCM_AHB2_PERIPH_FPU       : Enable FPU reset
 *                       @arg RCM_AHB2_PERIPH_BN        : Enable BN reset
 *                       @arg RCM_AHB2_PERIPH_SM        : Enable SM reset
 *                       @arg RCM_AHB2_PERIPH_CRYP      : Enable CRYP reset
 *                       @arg RCM_AHB2_PERIPH_HASH      : Enable HASH reset
 *                       @arg RCM_AHB2_PERIPH_RNG       : Enable RNG reset
 *                       @arg RCM_AHB2_PERIPH_OTG_FS    : Enable OTG FS reset
 *
 * @retval    None
 */
void RCM_EnableAHB2PeriphReset(uint32_t AHB2Periph)
{
    RCM->AHB2RST |= AHB2Periph;
}

/*!
 * @brief    Disable AHB2 peripheral reset
 *
 * @param    AHB2Periph : Disable the specifies reset of AHB2 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB2_PERIPH_DCI       : Disable DCI reset
 *                       @arg RCM_AHB2_PERIPH_FPU       : Disable FPU reset
 *                       @arg RCM_AHB2_PERIPH_BN        : Disable BN reset
 *                       @arg RCM_AHB2_PERIPH_SM        : Disable SM reset
 *                       @arg RCM_AHB2_PERIPH_CRYP      : Disable CRYP reset
 *                       @arg RCM_AHB2_PERIPH_HASH      : Disable HASH reset
 *                       @arg RCM_AHB2_PERIPH_RNG       : Disable RNG reset
 *                       @arg RCM_AHB2_PERIPH_OTG_FS    : Disable OTG FS reset
 *
 * @retval    None
 */
void RCM_DisableAHB2PeriphReset(uint32_t AHB2Periph)
{
    RCM->AHB2RST &= (uint32_t)~AHB2Periph;
}

