RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rcm.c
/*!
 * @brief    Enable the Low Speed APB (APB1) peripheral reset
 *
 * @param    APB1Periph : Enable specifies reset of the APB1 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB1_PERIPH_TMR2   : Enable TMR2 reset
 *                        @arg RCM_APB1_PERIPH_TMR3   : Enable TMR3 reset
 *                        @arg RCM_APB1_PERIPH_TMR4   : Enable TMR4 reset
 *                        @arg RCM_APB1_PERIPH_TMR5   : Enable TMR5 reset
 *                        @arg RCM_APB1_PERIPH_TMR6   : Enable TMR6 reset
 *                        @arg RCM_APB1_PERIPH_TMR7   : Enable TMR7 reset
 *                        @arg RCM_APB1_PERIPH_TMR12  : Enable TMR12 reset
 *                        @arg RCM_APB1_PERIPH_TMR13  : Enable TMR13 reset
 *                        @arg RCM_APB1_PERIPH_TMR14  : Enable TMR14 reset
 *                        @arg RCM_APB1_PERIPH_WWDT   : Enable WWDT reset
 *                        @arg RCM_APB1_PERIPH_SPI2   : Enable SPI2 reset
 *                        @arg RCM_APB1_PERIPH_SPI3   : Enable SPI3 reset
 *                        @arg RCM_APB1_PERIPH_USART2 : Enable USART2 reset
 *                        @arg RCM_APB1_PERIPH_USART3 : Enable USART3 reset
 *                        @arg RCM_APB1_PERIPH_UART4  : Enable UART4 reset
 *                        @arg RCM_APB1_PERIPH_UART5  : Enable UART5 reset
 *                        @arg RCM_APB1_PERIPH_I2C1   : Enable I2C1 reset
 *                        @arg RCM_APB1_PERIPH_I2C2   : Enable I2C2 reset
 *                        @arg RCM_APB1_PERIPH_I2C3   : Enable I2C3 reset
 *                        @arg RCM_APB1_PERIPH_FMPI2C1: Enable FMPI2C1 reset
 *                        @arg RCM_APB1_PERIPH_CAN1   : Enable CAN1 reset
 *                        @arg RCM_APB1_PERIPH_CAN2   : Enable CAN2 reset
 *                        @arg RCM_APB1_PERIPH_PMU    : Enable PMU reset
 *                        @arg RCM_APB1_PERIPH_DAC    : Enable DAC reset
 *                        @arg RCM_APB1_PERIPH_UART7  : Enable UART7 reset
 *                        @arg RCM_APB1_PERIPH_UART8  : Enable UART8 reset
 *
 * @retval   None
 */
void RCM_EnableAPB1PeriphReset(uint32_t APB1Periph)
{
    RCM->APB1RST |= APB1Periph;
}

/*!
 * @brief    Disable the Low Speed APB (APB1) peripheral reset
 *
 * @param    APB1Periph : Disable specifies reset of the APB1 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB1_PERIPH_TMR2   : Disable TMR2 reset
 *                        @arg RCM_APB1_PERIPH_TMR3   : Disable TMR3 reset
 *                        @arg RCM_APB1_PERIPH_TMR4   : Disable TMR4 reset
 *                        @arg RCM_APB1_PERIPH_TMR5   : Disable TMR5 reset
 *                        @arg RCM_APB1_PERIPH_TMR6   : Disable TMR6 reset
 *                        @arg RCM_APB1_PERIPH_TMR7   : Disable TMR7 reset
 *                        @arg RCM_APB1_PERIPH_TMR12  : Disable TMR12 reset
 *                        @arg RCM_APB1_PERIPH_TMR13  : Disable TMR13 reset
 *                        @arg RCM_APB1_PERIPH_TMR14  : Disable TMR14 reset
 *                        @arg RCM_APB1_PERIPH_WWDT   : Disable WWDT reset
 *                        @arg RCM_APB1_PERIPH_SPI2   : Disable SPI2 reset
 *                        @arg RCM_APB1_PERIPH_SPI3   : Disable SPI3 reset
 *                        @arg RCM_APB1_PERIPH_USART2 : Disable USART2 reset
 *                        @arg RCM_APB1_PERIPH_USART3 : Disable USART3 reset
 *                        @arg RCM_APB1_PERIPH_UART4  : Disable UART4 reset
 *                        @arg RCM_APB1_PERIPH_UART5  : Disable UART5 reset
 *                        @arg RCM_APB1_PERIPH_I2C1   : Disable I2C1 reset
 *                        @arg RCM_APB1_PERIPH_I2C2   : Disable I2C2 reset
 *                        @arg RCM_APB1_PERIPH_I2C3   : Disable I2C3 reset
 *                        @arg RCM_APB1_PERIPH_FMPI2C1: Disable FMPI2C1 reset
 *                        @arg RCM_APB1_PERIPH_CAN1   : Disable CAN1 reset
 *                        @arg RCM_APB1_PERIPH_CAN2   : Disable CAN2 reset
 *                        @arg RCM_APB1_PERIPH_PMU    : Disable PMU reset
 *                        @arg RCM_APB1_PERIPH_DAC    : Disable DAC reset
 *                        @arg RCM_APB1_PERIPH_UART7  : Disable UART7 reset
 *                        @arg RCM_APB1_PERIPH_UART8  : Disable UART8 reset
 *
 * @retval   None
 */
void RCM_DisableAPB1PeriphReset(uint32_t APB1Periph)
{
    RCM->APB1RST &= (uint32_t)~APB1Periph;
}

/*!
 * @brief    Enable the High Speed APB (APB2) peripheral reset
 *
 * @param    APB2Periph : Enable specifies reset of the APB2 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB2_PERIPH_TMR1   : TMR1 reset
 *                        @arg RCM_APB2_PERIPH_TMR8   : TMR8 reset
 *                        @arg RCM_APB2_PERIPH_USART1 : USART1 reset
 *                        @arg RCM_APB2_PERIPH_USART6 : USART6 reset
 *                        @arg RCM_APB2_PERIPH_ADC    : All of ADC reset
 *                        @arg RCM_APB2_PERIPH_SDIO   : SDIO reset
 *                        @arg RCM_APB2_PERIPH_SPI1   : SPI1 reset
 *                        @arg RCM_APB2_PERIPH_SPI4   : SPI4 reset
 *                        @arg RCM_APB2_PERIPH_SYSCFG : SYSCFG reset
 *                        @arg RCM_APB2_PERIPH_TMR9   : TMR9 reset
 *                        @arg RCM_APB2_PERIPH_TMR10  : TMR10 reset
 *                        @arg RCM_APB2_PERIPH_TMR11  : TMR11 reset
 *                        @arg RCM_APB2_PERIPH_SPI5   : SPI5 reset
 *                        @arg RCM_APB2_PERIPH_SPI6   : SPI6 reset
 *
 * @retval   None
 */
void RCM_EnableAPB2PeriphReset(uint32_t APB2Periph)
{
    RCM->APB2RST |= APB2Periph;
}

/*!
 * @brief    Disable the High Speed APB (APB2) peripheral reset
 *
 * @param    APB2Periph : Disable specifies reset of the APB2 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB2_PERIPH_TMR1   : TMR1 reset
 *                        @arg RCM_APB2_PERIPH_TMR8   : TMR8 reset
 *                        @arg RCM_APB2_PERIPH_USART1 : USART1 reset
 *                        @arg RCM_APB2_PERIPH_USART6 : USART6 reset
 *                        @arg RCM_APB2_PERIPH_ADC1   : ADC1 reset
 *                        @arg RCM_APB2_PERIPH_ADC2   : ADC2 reset
 *                        @arg RCM_APB2_PERIPH_ADC3   : ADC3 reset
 *                        @arg RCM_APB2_PERIPH_SDIO   : SDIO reset
 *                        @arg RCM_APB2_PERIPH_SPI1   : SPI1 reset
 *                        @arg RCM_APB2_PERIPH_SPI4   : SPI4 reset
 *                        @arg RCM_APB2_PERIPH_SYSCFG : SYSCFG reset
 *                        @arg RCM_APB2_PERIPH_TMR9   : TMR9 reset
 *                        @arg RCM_APB2_PERIPH_TMR10  : TMR10 reset
 *                        @arg RCM_APB2_PERIPH_TMR11  : TMR11 reset
 *                        @arg RCM_APB2_PERIPH_SPI5   : SPI5 reset
 *                        @arg RCM_APB2_PERIPH_SPI6   : SPI6 reset
 *
 * @retval   None
 */
void RCM_DisableAPB2PeriphReset(uint32_t APB2Periph)
{
    RCM->APB2RST &= (uint32_t)~APB2Periph;
}

/*!
 * @brief    Enables AHB1 peripheral clock during Low Power (Sleep) mode
 *
 * @param    AHB1Periph : Enable the specifies clock of AHB peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB1_PERIPH_GPIOA       : Enable GPIOA clock
 *                       @arg RCM_AHB1_PERIPH_GPIOB       : Enable GPIOB clock
 *                       @arg RCM_AHB1_PERIPH_GPIOC       : Enable GPIOC clock
 *                       @arg RCM_AHB1_PERIPH_GPIOD       : Enable GPIOD clock
 *                       @arg RCM_AHB1_PERIPH_GPIOE       : Enable GPIOE clock
 *                       @arg RCM_AHB1_PERIPH_GPIOF       : Enable GPIOF clock
 *                       @arg RCM_AHB1_PERIPH_GPIOG       : Enable GPIOG clock
 *                       @arg RCM_AHB1_PERIPH_GPIOI       : Enable GPIOI clock
 *                       @arg RCM_AHB1_PERIPH_CRC         : Enable CRC clock
 *                       @arg RCM_AHB1_PERIPH_BKPSRAM     : Enable BKPSRAM interface clock
 *                       @arg RCM_AHB1_PERIPH_CCMDATARAMEN: Enable CCM data RAM interface clock
 *                       @arg RCM_AHB1_PERIPH_DMA1        : Enable DMA1 clock
 *                       @arg RCM_AHB1_PERIPH_DMA2        : Enable DMA2 clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC     : Enable Ethernet MAC clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Tx  : Enable Ethernet Transmission clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Rx  : Enable Ethernet Reception clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_PTP : Enable Ethernet PTP clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS      : Enable USB OTG HS clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS_ULPI : Enable USB OTG HS ULPI clock
 *
 * @retval    None
 */
void RCM_EnableAHB1PeriphClockLPMode(uint32_t AHB1Periph)
{
    RCM->LPAHB1CLKEN |= AHB1Periph;
}

/*!
 * @brief    Disable AHB1 peripheral clock during Low Power (Sleep) mode
 *
 * @param    AHB1Periph : Disable the specifies clock of AHB1 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB1_PERIPH_GPIOA       : Disable GPIOA clock
 *                       @arg RCM_AHB1_PERIPH_GPIOB       : Disable GPIOB clock
 *                       @arg RCM_AHB1_PERIPH_GPIOC       : Disable GPIOC clock
 *                       @arg RCM_AHB1_PERIPH_GPIOD       : Disable GPIOD clock
 *                       @arg RCM_AHB1_PERIPH_GPIOE       : Disable GPIOE clock
 *                       @arg RCM_AHB1_PERIPH_GPIOF       : Disable GPIOF clock
 *                       @arg RCM_AHB1_PERIPH_GPIOG       : Disable GPIOG clock
 *                       @arg RCM_AHB1_PERIPH_GPIOI       : Disable GPIOI clock
 *                       @arg RCM_AHB1_PERIPH_CRC         : Disable CRC clock
 *                       @arg RCM_AHB1_PERIPH_BKPSRAM     : Disable BKPSRAM interface clock
 *                       @arg RCM_AHB1_PERIPH_CCMDATARAMEN: Disable CCM data RAM interface clock
 *                       @arg RCM_AHB1_PERIPH_DMA1        : Disable DMA1 clock
 *                       @arg RCM_AHB1_PERIPH_DMA2        : Disable DMA2 clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC     : Disable Ethernet MAC clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Tx  : Disable Ethernet Transmission clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_Rx  : Disable Ethernet Reception clock
 *                       @arg RCM_AHB1_PERIPH_ETH_MAC_PTP : Disable Ethernet PTP clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS      : Disable USB OTG HS clock
 *                       @arg RCM_AHB1_PERIPH_OTG_HS_ULPI : Disable USB OTG HS ULPI clock
 *
 * @retval    None
 */
void RCM_DisableAHB1PeriphClockLPMode(uint32_t AHB1Periph)
{
    RCM->LPAHB1CLKEN &= (uint32_t)~AHB1Periph;
}

/*!
 * @brief    Enables AHB2 peripheral clock during Low Power (Sleep) mode
 *
 * @param    AHB2Periph : Enable the specifies clock of AHB2 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB2_PERIPH_DCI       : Enable DCI clock
 *                       @arg RCM_AHB2_PERIPH_FPU       : Enable FPU clock
 *                       @arg RCM_AHB2_PERIPH_BN        : Enable BN clock
 *                       @arg RCM_AHB2_PERIPH_SM        : Enable SM clock
 *                       @arg RCM_AHB2_PERIPH_CRYP      : Enable CRYP clock
 *                       @arg RCM_AHB2_PERIPH_HASH      : Enable HASH clock
 *                       @arg RCM_AHB2_PERIPH_RNG       : Enable RNG clock
 *                       @arg RCM_AHB2_PERIPH_OTG_FS    : Enable OTG FS clock
 *
 * @retval    None
 */
void RCM_EnableAHB2PeriphClockLPMode(uint32_t AHB2Periph)
{
    RCM->LPAHB2CLKEN |= AHB2Periph;
}

/*!
 * @brief    Disable AHB2 peripheral clock during Low Power (Sleep) mode
 *
 * @param    AHB2Periph : Disable the specifies clock of AHB2 peripheral
 *                       This parameter can be any combination of the following values:
 *                       @arg RCM_AHB2_PERIPH_DCI       : Disable DCI clock
 *                       @arg RCM_AHB2_PERIPH_FPU       : Disable FPU clock
 *                       @arg RCM_AHB2_PERIPH_BN        : Disable BN clock
 *                       @arg RCM_AHB2_PERIPH_SM        : Disable SM clock
 *                       @arg RCM_AHB2_PERIPH_CRYP      : Disable CRYP clock
 *                       @arg RCM_AHB2_PERIPH_HASH      : Disable HASH clock
 *                       @arg RCM_AHB2_PERIPH_RNG       : Disable RNG clock
 *                       @arg RCM_AHB2_PERIPH_OTG_FS    : Disable OTG FS clock
 *
 * @retval    None
 */
void RCM_DisableAHB2PeriphClockLPMode(uint32_t AHB2Periph)
{
    RCM->LPAHB2CLKEN &= (uint32_t)~AHB2Periph;
}

/*!
 * @brief    Enable the Low Speed APB (APB1) peripheral clock during Low Power (Sleep) mode
 *
 * @param    APB1Periph : Enable specifies clock of the APB1 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB1_PERIPH_TMR2   : Enable TMR2 clock
 *                        @arg RCM_APB1_PERIPH_TMR3   : Enable TMR3 clock
 *                        @arg RCM_APB1_PERIPH_TMR4   : Enable TMR4 clock
 *                        @arg RCM_APB1_PERIPH_TMR5   : Enable TMR5 clock
 *                        @arg RCM_APB1_PERIPH_TMR6   : Enable TMR6 clock
 *                        @arg RCM_APB1_PERIPH_TMR7   : Enable TMR7 clock
 *                        @arg RCM_APB1_PERIPH_TMR12  : Enable TMR12 clock
 *                        @arg RCM_APB1_PERIPH_TMR13  : Enable TMR13 clock
 *                        @arg RCM_APB1_PERIPH_TMR14  : Enable TMR14 clock
 *                        @arg RCM_APB1_PERIPH_WWDT   : Enable WWDT clock
 *                        @arg RCM_APB1_PERIPH_SPI2   : Enable SPI2 clock
 *                        @arg RCM_APB1_PERIPH_SPI3   : Enable SPI3 clock
 *                        @arg RCM_APB1_PERIPH_USART2 : Enable USART2 clock
 *                        @arg RCM_APB1_PERIPH_USART3 : Enable USART3 clock
 *                        @arg RCM_APB1_PERIPH_UART4  : Enable UART4 clock
 *                        @arg RCM_APB1_PERIPH_UART5  : Enable UART5 clock
 *                        @arg RCM_APB1_PERIPH_I2C1   : Enable I2C1 clock
 *                        @arg RCM_APB1_PERIPH_I2C2   : Enable I2C2 clock
 *                        @arg RCM_APB1_PERIPH_I2C3   : Enable I2C3 clock
 *                        @arg RCM_APB1_PERIPH_FMPI2C1: Enable FMPI2C1 clock
 *                        @arg RCM_APB1_PERIPH_CAN1   : Enable CAN1 clock
 *                        @arg RCM_APB1_PERIPH_CAN2   : Enable CAN2 clock
 *                        @arg RCM_APB1_PERIPH_PMU    : Enable PMU clock
 *                        @arg RCM_APB1_PERIPH_DAC    : Enable DAC clock
 *                        @arg RCM_APB1_PERIPH_UART7  : Enable UART7 clock
 *                        @arg RCM_APB1_PERIPH_UART8  : Enable UART8 clock
 *
 * @retval   None
 */
void RCM_EnableAPB1PeriphClockLPMode(uint32_t APB1Periph)
{
    RCM->LPAPB1CLKEN |= APB1Periph;
}

/*!
 * @brief    Disable the Low Speed APB (APB1) peripheral clock during Low Power (Sleep) mode
 *
 * @param    APB1Periph : Disable specifies clock of the APB1 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB1_PERIPH_TMR2   : Disable TMR2 clock
 *                        @arg RCM_APB1_PERIPH_TMR3   : Disable TMR3 clock
 *                        @arg RCM_APB1_PERIPH_TMR4   : Disable TMR4 clock
 *                        @arg RCM_APB1_PERIPH_TMR5   : Disable TMR5 clock
 *                        @arg RCM_APB1_PERIPH_TMR6   : Disable TMR6 clock
 *                        @arg RCM_APB1_PERIPH_TMR7   : Disable TMR7 clock
 *                        @arg RCM_APB1_PERIPH_TMR12  : Disable TMR12 clock
 *                        @arg RCM_APB1_PERIPH_TMR13  : Disable TMR13 clock
 *                        @arg RCM_APB1_PERIPH_TMR14  : Disable TMR14 clock
 *                        @arg RCM_APB1_PERIPH_WWDT   : Disable WWDT clock
 *                        @arg RCM_APB1_PERIPH_SPI2   : Disable SPI2 clock
 *                        @arg RCM_APB1_PERIPH_SPI3   : Disable SPI3 clock
 *                        @arg RCM_APB1_PERIPH_USART2 : Disable USART2 clock
 *                        @arg RCM_APB1_PERIPH_USART3 : Disable USART3 clock
 *                        @arg RCM_APB1_PERIPH_UART4  : Disable UART4 clock
 *                        @arg RCM_APB1_PERIPH_UART5  : Disable UART5 clock
 *                        @arg RCM_APB1_PERIPH_I2C1   : Disable I2C1 clock
 *                        @arg RCM_APB1_PERIPH_I2C2   : Disable I2C2 clock
 *                        @arg RCM_APB1_PERIPH_I2C3   : Disable I2C3 clock
 *                        @arg RCM_APB1_PERIPH_FMPI2C1: Disable FMPI2C1 clock
 *                        @arg RCM_APB1_PERIPH_CAN1   : Disable CAN1 clock
 *                        @arg RCM_APB1_PERIPH_CAN2   : Disable CAN2 clock
 *                        @arg RCM_APB1_PERIPH_PMU    : Disable PMU clock
 *                        @arg RCM_APB1_PERIPH_DAC    : Disable DAC clock
 *                        @arg RCM_APB1_PERIPH_UART7  : Disable UART7 clock
 *                        @arg RCM_APB1_PERIPH_UART8  : Disable UART8 clock
 *
 * @retval   None
 */
void RCM_DisableAPB1PeriphClockLPMode(uint32_t APB1Periph)
{
    RCM->LPAPB1CLKEN &= (uint32_t)~APB1Periph;
}

/*!
 * @brief    Enable the High Speed APB (APB2) peripheral clock during Low Power (Sleep) mode
 *
 * @param    APB2Periph : Enable specifies clock of the APB2 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB2_PERIPH_TMR1   : TMR1 clock
 *                        @arg RCM_APB2_PERIPH_TMR8   : TMR8 clock
 *                        @arg RCM_APB2_PERIPH_USART1 : USART1 clock
 *                        @arg RCM_APB2_PERIPH_USART6 : USART6 clock
 *                        @arg RCM_APB2_PERIPH_ADC1   : ADC1 clock
 *                        @arg RCM_APB2_PERIPH_ADC2   : ADC2 clock
 *                        @arg RCM_APB2_PERIPH_ADC3   : ADC3 clock
 *                        @arg RCM_APB2_PERIPH_SDIO   : SDIO clock
 *                        @arg RCM_APB2_PERIPH_SPI1   : SPI1 clock
 *                        @arg RCM_APB2_PERIPH_SPI4   : SPI4 clock
 *                        @arg RCM_APB2_PERIPH_SYSCFG : SYSCFG clock
 *                        @arg RCM_APB2_PERIPH_TMR9   : TMR9 clock
 *                        @arg RCM_APB2_PERIPH_TMR10  : TMR10 clock
 *                        @arg RCM_APB2_PERIPH_TMR11  : TMR11 clock
 *                        @arg RCM_APB2_PERIPH_SPI5   : SPI5 clock
 *                        @arg RCM_APB2_PERIPH_SPI6   : SPI6 clock
 *
 * @retval   None
 */
void RCM_EnableAPB2PeriphClockLPMode(uint32_t APB2Periph)
{
    RCM->LPAPB2CLKEN |= APB2Periph;
}

/*!
 * @brief    Disable the High Speed APB (APB2) peripheral clock during Low Power (Sleep) mode
 *
 * @param    APB2Periph : Disable specifies clock of the APB2 peripheral.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_APB2_PERIPH_TMR1   : TMR1 clock
 *                        @arg RCM_APB2_PERIPH_TMR8   : TMR8 clock
 *                        @arg RCM_APB2_PERIPH_USART1 : USART1 clock
 *                        @arg RCM_APB2_PERIPH_USART6 : USART6 clock
 *                        @arg RCM_APB2_PERIPH_ADC1   : ADC1 clock
 *                        @arg RCM_APB2_PERIPH_ADC2   : ADC2 clock
 *                        @arg RCM_APB2_PERIPH_ADC3   : ADC3 clock
 *                        @arg RCM_APB2_PERIPH_SDIO   : SDIO clock
 *                        @arg RCM_APB2_PERIPH_SPI1   : SPI1 clock
 *                        @arg RCM_APB2_PERIPH_SPI4   : SPI4 clock
 *                        @arg RCM_APB2_PERIPH_SYSCFG : SYSCFG clock
 *                        @arg RCM_APB2_PERIPH_TMR9   : TMR9 clock
 *                        @arg RCM_APB2_PERIPH_TMR10  : TMR10 clock
 *                        @arg RCM_APB2_PERIPH_TMR11  : TMR11 clock
 *                        @arg RCM_APB2_PERIPH_SPI5   : SPI5 clock
 *                        @arg RCM_APB2_PERIPH_SPI6   : SPI6 clock
 *
 * @retval   None
 */
void RCM_DisableAPB2PeriphClockLPMode(uint32_t APB2Periph)
{
    RCM->LPAPB2CLKEN &= (uint32_t)~APB2Periph;
}

/*!
 * @brief     Enable RCM interrupts
 *
 * @param     interrupt : Enable specifies RCM interrupt sources.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_INT_LSIRDY  : LSI ready interrupt
 *                        @arg RCM_INT_LSERDY  : LSE ready interrupt
 *                        @arg RCM_INT_HSIRDY  : HSI ready interrupt
 *                        @arg RCM_INT_HSERDY  : HSE ready interrupt
 *                        @arg RCM_INT_PLL1RDY : PLL1 ready interrupt
 *                        @arg RCM_INT_PLL2RDY : PLL2 ready interrupt
 *
 * @retval    None
 */
void RCM_EnableInterrupt(uint32_t interrupt)
{
    uint32_t temp;

    temp = interrupt << 8;

    RCM->INT |= temp;
}

/*!
 * @brief     Disable RCM interrupts
 *
 * @param     interrupt : Disable specifies RCM interrupt sources.
 *                        This parameter can be any combination of the following values:
 *                        @arg RCM_INT_LSIRDY  : LSI ready interrupt
 *                        @arg RCM_INT_LSERDY  : LSE ready interrupt
 *                        @arg RCM_INT_HSIRDY  : HSI ready interrupt
 *                        @arg RCM_INT_HSERDY  : HSE ready interrupt
 *                        @arg RCM_INT_PLL1RDY : PLL1 ready interrupt
 *                        @arg RCM_INT_PLL2RDY : PLL2 ready interrupt
 *
 * @retval    None
 */
void RCM_DisableInterrupt(uint32_t interrupt)
{
    uint32_t temp;

    temp = interrupt << 8;

    RCM->INT &= (uint32_t)~temp;
}

/*!
 * @brief     Read the specified RCM flag status
 *
 * @param     flag : Returns specifies the flag status.
 *                   This parameter can be one of the following values:
 *                   @arg RCM_FLAG_HSIRDY  : HSI ready flag
 *                   @arg RCM_FLAG_HSERDY  : HSE ready flag
 *                   @arg RCM_FLAG_PLL1RDY : PLL1 ready flag
 *                   @arg RCM_FLAG_PLL2RDY : PLL2 ready flag
 *                   @arg RCM_FLAG_LSERDY  : LSE ready flag
 *                   @arg RCM_FLAG_LSIRDY  : LSI ready flag
 *                   @arg RCM_FLAG_BORRST  : POR/PDR or BOR reset
 *                   @arg RCM_FLAG_PINRST  : NRST PIN Reset Occur Flag
 *                   @arg RCM_FLAG_PORRST  : POR/PDR Reset Occur Flag
 *                   @arg RCM_FLAG_SWRST   : Software Reset Occur Flag
 *                   @arg RCM_FLAG_IWDTRST : Independent Watchdog Reset Occur Flag
 *                   @arg RCM_FLAG_WWDTRST : Window Watchdog Reset Occur Flag
 *                   @arg RCM_FLAG_LPRRST  : Low Power Reset Occur Flag
 *
 * @retval    The new state of flag (SET or RESET)
 */
uint8_t RCM_ReadStatusFlag(RCM_FLAG_T flag)
{
    uint32_t reg, bit;

    bit = (uint32_t)(1 << (flag & 0xff));

    reg = (flag >> 8) & 0xff;

    switch (reg)
    {
        case 0:
            reg = RCM->CTRL;
            break;

        case 1:
            reg = RCM->BDCTRL;
            break;

